const temperatureDegr = prompt("Введите температуру по Цельсию");
const temperatureFar = (9 / 5) * temperatureDegr + 32;
console.log(`Температура по Цельсию: ${temperatureDegr}, по Фарингейту: ${temperatureFar}`);


// Необходимо создать переменную в которой будет храниться температура в градусах Цельсия, преобразовать значение в температуру по фаренгейту.
// Формула перевода градусов Цельсия в градусы Фаренгейта: градусы Фаренгейта = (9 / 5) * градусы Цельсия + 32
// Вывести в консоль температуру в Цельсиях и Фаренгейтах.

const userName = "Roman";
const admin = userName;
console.log(admin);








// Необходимо создать переменную name, записать в эту переменную свое имя. Необходимо также создать переменную admin и присвоить этой переменной значение из переменной name. Вывести значение переменной admin в консоль.