"use strict";

/*
Необходимо найти любой бесплатный api в интернете на произвольную тему, 
из которого нужно будет получить данные и сохранить их в файл data.js,
который необходимо создать рядом с текущим html-файлом. Внутри файла data.js 
создайте переменную, которая будет хранить данные из публичного api. Данные 
из api необходимо просто скопировать и вставить как значение данной переменной.
Минимальный набор данных, который нас интересует в api: загловок, картинка, 
параграф.

Создайте еще один файл main.js, в котором необходимо из значений переменной, 
которая создана в файле data.js, сформировать контент из данных.
Добавить данный контент на сайт, в div с классом app.

Можете добавить стили, если есть желание (не обязательно).
*/
